app/controllers/userprefs_controller.rb

  def index
    conditions = []
    conditions += ["username = '@#{params[:domain]}'"] unless params[:domain].blank?
    conditions += ["username = '#{params[:user]}'"] unless params[:user].blank?
    conditions = conditions.join(" OR ")

    @userprefs = Userpref.paginate :page => params[:page] || 1, :per_page => params[:per_page] || 10, :conditions => conditions, :order => :username
---
SELECT * FROM `userprefs` WHERE (username = '@example.com' OR username = 'admin_tester@example.com') ORDER BY username LIMIT 0, 10
SELECT count(*) AS count_all FROM `userprefs` WHERE (username = '@example.com' OR username = 'admin_tester@example.com')

  def show
    @userpref = Userpref.find(params[:id])
---
SELECT * FROM `userprefs` WHERE (`userprefs`.`prefid` = 5)

  def create
    params[:white_list][:preference] = "whitelist_from"
    normalize_params
    userpref = Userpref.new params[:white_list]
    if userpref.valid? && userpref.save
---
INSERT INTO `userprefs` (`username`, `value`, `preference`) VALUES('@example.com', 'email@example.com', 'whitelist_from')

  def destroy
    @userpref = Userpref.find(params[:id])
    @userpref.destroy
---
SELECT * FROM `userprefs` WHERE (`userprefs`.`prefid` = 5)
DELETE FROM `userprefs` WHERE `prefid` = 5

  def clear_all
    Userpref.destroy_all if RAILS_ENV == "cucumber" || RAILS_ENV == "test"
---
DELETE FROM `userprefs` WHERE `prefid` = 1